"""
疑问词集
    用于判断标题是否疑问类型
    根据权重判断
    问号权重最大
"""
INTERROGATIVE_WORD_DICT = {
    'symple_value_100': [
        '?', '？'
    ], # 1 符号判断 权重最大，往下依次递减
    'yiwenci_value_99': [
        '呢', '吗', '吧', '啊'
    ], # 2 语气词判断
    'yiwenci_value_98': [
        '难道', '何必', '居然', '竟然', '究竟', '简直', '难怪', '何尝',
        '岂', '反倒'
    ],
    'yiwenci_value_97': [
        '怎', '怎么', '怎的', '怎样', '怎么样', '怎么着', '怎么做',
        '为什么', '如何', '是否', '有何', '为何',
    ],
    'yiwenci_value_96': [
        '哪', '谁', '何',
        '什么', '什么时候',
        '哪儿', '哪里', '哪些', '哪家', '在哪',
        '几时', '何时', '几',
        '多大', '多久', '多少',
        '能不能', '有没有', '会不会', '要不要', '应不应该',
        '是什么', '有什么', '怎么办', '怎么回事', '好不好'
    ],
    'tongyong':[
        '解决', '判断', '策略',
        '值得', '解决',  '回事',  '还是', '是谁', '才能',  '值',
        '更值', '又能', '得出', '面对',
        '可以','存在', '区别',
        '机会', '秘诀', '有何影响', '什么影响', '意义', '思考', '应对', '结论', '方向', '原因', '分析', '启示', '优势', '参考', '问题',
    ]
}

